
&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = 1 Тогда
		ЭтотОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВернутьТекПользователя()
	Возврат ПараметрыСеанса.Пользователь;	
КонецФункции

&НаКлиенте
Процедура ЧатСУчастником(Команда)
	Инд = Элементы.СписокУчастников.ТекущаяСтрока;
	Если Инд <> Неопределено Тогда
		Участник = Объект.СписокУчастников[Инд].Участник;
		Организатор = ВернутьТекПользователя();
		Ссылка = ЧатСГлавнымНаСервере(Организатор, Участник);
		Парам = Новый Структура("Ключ", Ссылка);
		ОткрытьФорму("Справочник.Чаты.Форма.ФормаЭлемента", Парам);
	Иначе
		Сообщить("Выберите строку с нужным участником!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЧатСОтветственным(Команда)
	Инд = Элементы.МоиРаспределения.ТекущаяСтрока;
	Если Инд <> Неопределено Тогда
		Организатор = ЭтотОбъект.МоиРаспределения[Инд].Ответственный;
		Участник = ВернутьТекПользователя();
		Ссылка = ЧатСГлавнымНаСервере(Организатор, Участник);
		Парам = Новый Структура("Ключ", Ссылка);
		ОткрытьФорму("Справочник.Чаты.Форма.ФормаЭлемента", Парам);
	Иначе
		Сообщить("Выберите строку с нужным организатором!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СократитьФИО(ФИО)
	Масс = СтрРазделить(ФИО, " ");
	Ответ = Масс[0];
	Попытка
		Ответ = Ответ + " " + Лев(Масс[1], 1) + ".";
		Ответ = Ответ + " " + Лев(Масс[2], 1) + ".";
	Исключение
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции


&НаСервере
Функция ЧатСГлавнымНаСервере(Организатор, Участник)
	Ссылка = Справочники.Чаты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Чаты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Чаты КАК Чаты
		|ГДЕ
		|	Чаты.Участник = &Участник
		|	И Чаты.Организатор = &Организатор";
	
	Запрос.УстановитьПараметр("Участник", Участник);
	Запрос.УстановитьПараметр("Организатор", Организатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если Ссылка.Пустая() Тогда
		НовыйЧат = Справочники.Чаты.СоздатьЭлемент();
		НовыйЧат.Организатор = Организатор;
		НовыйЧат.Участник = Участник;
		НовыйЧат.Наименование = СократитьФИО(Участник.Наименование) + " и " + СократитьФИО(Организатор.Наименование);
		НовыйЧат.Записать();
		Ссылка = НовыйЧат.Ссылка;
	КонецЕсли;
	
	Возврат Ссылка;
КонецФункции

&НаКлиенте
Процедура ЧатСГлавным(Команда)
	Участник = ВернутьТекПользователя();
	Организатор = Объект.ГлавныйОрганизатор;
	Ссылка = ЧатСГлавнымНаСервере(Организатор, Участник);
	Парам = Новый Структура("Ключ", Ссылка);
	ОткрытьФорму("Справочник.Чаты.Форма.ФормаЭлемента", Парам);
КонецПроцедуры

&НаСервере
Процедура РаспределенияОтветственныйПриИзмененииНаСервере()
	Инд = Элементы.Распределения.ТекущаяСтрока;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МероприятияРаспределения.Ответственный КАК Ответственный,
		|	МероприятияРаспределения.ВремяНачала КАК ВремяНачала,
		|	МероприятияРаспределения.ВремяОкончания КАК ВремяОкончания
		|ИЗ
		|	Справочник.Мероприятия.Распределения КАК МероприятияРаспределения
		|ГДЕ
		|	(МероприятияРаспределения.ВремяНачала < &ВремяНачала
		|	И &ВремяНачала <= МероприятияРаспределения.ВремяОкончания
		|	ИЛИ МероприятияРаспределения.ВремяНачала <= &ВремяОкончания
		|	И &ВремяОкончания < МероприятияРаспределения.ВремяОкончания)
		|	И МероприятияРаспределения.Ответственный = &Ответственный";
	
	Запрос.УстановитьПараметр("ВремяНачала", Объект.Распределения[Инд].ВремяНачала);
	Запрос.УстановитьПараметр("ВремяОкончания", Объект.Распределения[Инд].ВремяОкончания);
	Запрос.УстановитьПараметр("ВремяОкончания", Объект.Распределения[Инд].Ответственный);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ФИО = ВыборкаДетальныеЗаписи.Ответственный.Наименование;
		ВремяНачала = Формат(ВыборкаДетальныеЗаписи.ВремяНачала, "ДФ=дд.ММ.гг ЧЧ:мм:сс");
		ВремяОкончания = Формат(ВыборкаДетальныеЗаписи.ВремяОкончания, "ДФ=дд.ММ.гг ЧЧ:мм:сс");
		
		Сообщить(ФИО + " уже занят с " + ВремяНачала + " по " + ВремяОкончания + "!");
		Объект.Распределения[Инд].Ответственный = Справочники.Пользователи.ПустаяСсылка();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределенияОтветственныйПриИзменении(Элемент)
	РаспределенияОтветственныйПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	Элементы.СписокУчастников.КоманднаяПанель.Видимость = (Объект.Статус = Перечисления.СтатусыМероприятий.Внутреннее);
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПараметрыСеанса.Пользователь.ТипАккаунта = Перечисления.ТипыАккаунтов.Участник Тогда
		Элементы.ЧатСУчастником.Видимость = Ложь;
		Элементы.ГруппаСписокУчастников.Видимость = Ложь;
		Элементы.Основное.ТолькоПросмотр = Истина;
		Элементы.Распределения.Видимость = Ложь;
		
		Для Каждого Стр Из Объект.Распределения Цикл
			Если Стр.Распределение.Участники.Найти(ПараметрыСеанса.Пользователь) <> Неопределено Тогда
				МояСтр = МоиРаспределения.Добавить();
				МояСтр.Распределение = Стр.Распределение;
				МояСтр.ВремяНачала = Стр.ВремяНачала;
				МояСтр.ВремяОкончания = Стр.ВремяОкончания;
				МояСтр.Аудитория = Стр.Аудитория;
				МояСтр.Ответственный = Стр.Ответственный;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Элементы.ЧатСГлавным.Видимость = Ложь;
		Элементы.ЧатСОтветственным.Видимость = Ложь;
		Элементы.МоиРаспределения.Видимость = Ложь;
	КонецЕсли;
	
	СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбщедоступнаяРегистрацияПриИзмененииНаСервере()
	Если Объект.ОбщедоступнаяРегистрация Тогда
		Объект.Статус = Перечисления.СтатусыМероприятий.Черновик;
	Иначе
		Объект.Статус = Перечисления.СтатусыМероприятий.Внутреннее;
	КонецЕсли;	
	
	Элементы.ГруппаСписокУчастников.Видимость = НЕ Объект.ОбщедоступнаяРегистрация;
КонецПроцедуры

&НаКлиенте
Процедура ОбщедоступнаяРегистрацияПриИзменении(Элемент)
	ОбщедоступнаяРегистрацияПриИзмененииНаСервере();
КонецПроцедуры
