
&НаСервере
Процедура ЧатСГлавнымНаСервере()
	Участник = ПараметрыСеанса.Пользователь;
	Организатор = Объект.ГлавныйОрганизатор;
	Ссылка = Справочники.Чаты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Чаты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Чаты КАК Чаты
		|ГДЕ
		|	Чаты.Участник = &Участник
		|	И Чаты.Организатор = &Организатор";
	
	Запрос.УстановитьПараметр("Участник", Участник);
	Запрос.УстановитьПараметр("Организатор", Организатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧатСГлавным(Команда)
	ЧатСГлавнымНаСервере();
КонецПроцедуры

&НаСервере
Процедура РаспределенияОтветственныйПриИзмененииНаСервере()
	Инд = Элементы.Распределения.ТекущаяСтрока;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МероприятияРаспределения.Ответственный КАК Ответственный,
		|	МероприятияРаспределения.ВремяНачала КАК ВремяНачала,
		|	МероприятияРаспределения.ВремяОкончания КАК ВремяОкончания
		|ИЗ
		|	Справочник.Мероприятия.Распределения КАК МероприятияРаспределения
		|ГДЕ
		|	(МероприятияРаспределения.ВремяНачала < &ВремяНачала
		|	И &ВремяНачала <= МероприятияРаспределения.ВремяОкончания
		|	ИЛИ МероприятияРаспределения.ВремяНачала <= &ВремяОкончания
		|	И &ВремяОкончания < МероприятияРаспределения.ВремяОкончания)
		|	И МероприятияРаспределения.Ответственный = &Ответственный";
	
	Запрос.УстановитьПараметр("ВремяНачала", Объект.Распределения[Инд].ВремяНачала);
	Запрос.УстановитьПараметр("ВремяОкончания", Объект.Распределения[Инд].ВремяОкончания);
	Запрос.УстановитьПараметр("ВремяОкончания", Объект.Распределения[Инд].Ответственный);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ФИО = ВыборкаДетальныеЗаписи.Ответственный.Наименование;
		ВремяНачала = Формат(ВыборкаДетальныеЗаписи.ВремяНачала, "ДФ=дд.ММ.гг ЧЧ:мм:сс");
		ВремяОкончания = Формат(ВыборкаДетальныеЗаписи.ВремяОкончания, "ДФ=дд.ММ.гг ЧЧ:мм:сс");
		
		Сообщить(ФИО + " уже занят с " + ВремяНачала + " по " + ВремяОкончания + "!");
		Объект.Распределения[Инд].Ответственный = Справочники.Пользователи.ПустаяСсылка();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределенияОтветственныйПриИзменении(Элемент)
	РаспределенияОтветственныйПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	Элементы.СписокУчастников.КоманднаяПанель.Видимость = (Объект.Статус = Перечисления.СтатусыМероприятий.Внутреннее);
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПараметрыСеанса.Пользователь.ТипАккаунта = Перечисления.ТипыАккаунтов.Участник Тогда
		Элементы.ГруппаСписокУчастников.Видимость = Ложь;
		Элементы.Основное.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ЧатСГлавным.Видимость = Ложь;
	КонецЕсли;
	
	СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбщедоступнаяРегистрацияПриИзмененииНаСервере()
	Если Объект.ОбщедоступнаяРегистрация Тогда
		Объект.Статус = Перечисления.СтатусыМероприятий.Черновик;
	Иначе
		Объект.Статус = Перечисления.СтатусыМероприятий.Внутреннее;
	КонецЕсли;	
	
	Элементы.ГруппаСписокУчастников.Видимость = НЕ Объект.ОбщедоступнаяРегистрация;
КонецПроцедуры

&НаКлиенте
Процедура ОбщедоступнаяРегистрацияПриИзменении(Элемент)
	ОбщедоступнаяРегистрацияПриИзмененииНаСервере();
КонецПроцедуры
