
&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	Элементы.ОбщедоступнаяРегистрация = (Объект.Статус = Перечисления.СтатусыМероприятий.Опубликованное);
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбщедоступнаяРегистрацияПриИзмененииНаСервере()
	Если Объект.ОбщедоступнаяРегистрация Тогда
		Объект.Статус = Перечисления.СтатусыМероприятий.Черновик;
	Иначе
		Объект.Статус = Перечисления.СтатусыМероприятий.Внутреннее;
	КонецЕсли;	
	
	Элементы.ГруппаСписокУчастников.Видимость = НЕ Объект.ОбщедоступнаяРегистрация;
КонецПроцедуры

&НаКлиенте
Процедура ОбщедоступнаяРегистрацияПриИзменении(Элемент)
	ОбщедоступнаяРегистрацияПриИзмененииНаСервере();
КонецПроцедуры
