
&НаКлиенте
Процедура Команда1(Команда)
	ОткрытьФорму("ОбщаяФорма.ЕдинаяСистемаАдминистратора");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура ВременноеЗакрытиеАудитории(Команда)
	ОткрытьФорму("Документ.ЗакрытиеАудитории.Форма.ФормаДокумента");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеМероприятиями(Команда)
	ОткрытьФорму("ОбщаяФорма.УправлениеМероприятиями");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеОрганизацией(Команда)
	ОткрытьФорму("ОбщаяФорма.УправлениеОрганизацией");
КонецПроцедуры
