
Функция ВернутьТекПользователя() Экспорт
	Возврат ПараметрыСеанса.Пользователь;	
КонецФункции

Функция ПроверкаНаНовогоПользователя() Экспорт
	Возврат НЕ ЗначениеЗаполнено(ПараметрыСеанса.Пользователь.Наименование);
КонецФункции

Функция ПроверкаНаАдминистратора() Экспорт
	Возврат ПараметрыСеанса.Пользователь.ТипАккаунта = Перечисления.ТипыАккаунтов.Администратор;
КонецФункции

Функция ПроверкаНаОрганизатора() Экспорт
	Возврат ПараметрыСеанса.Пользователь.ТипАккаунта = Перечисления.ТипыАккаунтов.Организатор;
КонецФункции

Функция ПроверкаНаУчастника() Экспорт
	Возврат ПараметрыСеанса.Пользователь.ТипАккаунта = Перечисления.ТипыАккаунтов.Участник;
КонецФункции