
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ТипАккаунта", Перечисления.ТипыАккаунтов.Участник);
КонецПроцедуры

&НаСервере
Процедура ПоискПоНомеруТелефонаПриИзмененииНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("НомерТелефона", ЭтотОбъект.ПоискПоНомеруТелефона);
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоНомеруТелефонаПриИзменении(Элемент)
	ПоискПоНомеруТелефонаПриИзмененииНаСервере();
КонецПроцедуры
