
&НаКлиенте
Процедура КонецЗакрытияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Аудитория) И ЗначениеЗаполнено(Объект.НачалоЗакрытия) И ЗначениеЗаполнено(Объект.КонецЗакрытия) Тогда
		АудиторияПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НачалоЗакрытияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Аудитория) И ЗначениеЗаполнено(Объект.НачалоЗакрытия) И ЗначениеЗаполнено(Объект.КонецЗакрытия) Тогда
		АудиторияПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура АудиторияПриИзмененииНаСервере()
	Объект.ИспользованиеНаМероприятиях.Очистить();
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МероприятияРаспределения.Ссылка КАК Мероприятие,
		|	МероприятияРаспределения.ВремяНачала КАК ВремяНачала,
		|	МероприятияРаспределения.ВремяОкончания КАК ВремяОкончания
		|ИЗ
		|	Справочник.Мероприятия.Распределения КАК МероприятияРаспределения
		|ГДЕ
		|	МероприятияРаспределения.ВремяНачала >= &ВремяНачала
		|	И МероприятияРаспределения.ВремяОкончания <= &ВремяОкончания
		|	И МероприятияРаспределения.Аудитория = &Аудитория";
	
	Запрос.УстановитьПараметр("ВремяНачала", Объект.НачалоЗакрытия);
	Запрос.УстановитьПараметр("ВремяОкончания", Объект.КонецЗакрытия);
		Запрос.УстановитьПараметр("Аудитория", Объект.Аудитория);
	
	РезультатЗапроса = Запрос.Выполнить();
	Объект.ИспользованиеНаМероприятиях.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура АудиторияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Аудитория) И ЗначениеЗаполнено(Объект.НачалоЗакрытия) И ЗначениеЗаполнено(Объект.КонецЗакрытия) Тогда
		АудиторияПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = ПараметрыСеанса.Пользователь.Организация;
КонецПроцедуры
