
&НаКлиенте
Процедура ИспользоватьФильтрПриИзменении(Элемент)
	ФильтрПоСтатусуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФильтрПоСтатусуПриИзмененииНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("Фильтр", ИспользоватьФильтр);
	Список.Параметры.УстановитьЗначениеПараметра("СтатусЗаявки", ФильтрПоСтатусу);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоСтатусуПриИзменении(Элемент)
	ФильтрПоСтатусуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.ИспользоватьФильтр = Истина;
	ЭтотОбъект.ФильтрПоСтатусу = Перечисления.СтатусыЗаявок.НаРассмотрении;
	
	
	Список.Параметры.УстановитьЗначениеПараметра("Организация", ПараметрыСеанса.Пользователь.Организация);
	Список.Параметры.УстановитьЗначениеПараметра("Фильтр", ИспользоватьФильтр);
	Список.Параметры.УстановитьЗначениеПараметра("СтатусЗаявки", ФильтрПоСтатусу);
КонецПроцедуры
