
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Элементы.ТипАккаунта.ТекстРедактирования = "Администратор" Тогда
		ОткрытьФорму("ОбщаяФорма.РабочийСтолАдминистратора");
	ИначеЕсли Элементы.ТипАккаунта.ТекстРедактирования = "Организатор" Тогда
		ОткрытьФорму("ОбщаяФорма.РабочийСтолОрганизатора");
	ИначеЕсли Элементы.ТипАккаунта.ТекстРедактирования = "Участник" Тогда
		ОткрытьФорму("ОбщаяФорма.РабочийСтолУчастника");
	Иначе
		ОткрытьФорму("ОбщаяФорма.РабочийСтолУчащегося");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ТипАккаунтаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТипАккаунтаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Попытка
		Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда
			Отказ = Истина;
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.ТипАккаунта = Перечисления.ТипыАккаунтов.Администратор Тогда
		
		// Проверка на новую запись
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда	
			Если ЗначениеЗаполнено(ЭтотОбъект.НазваниеОрганизации) Тогда
				
				// Проверка на уникальную организацию
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ
					|	Организации.Наименование КАК Наименование
					|ИЗ
					|	Справочник.Организации КАК Организации
					|ГДЕ
					|	Организации.Наименование = &Наименование";
				
				Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.НазваниеОрганизации);
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда			
					Отказ = Истина;
					Сообщить("Это название уже занято!");
				Иначе
					// Создание новой организации 
					Организация = Справочники.Организации.СоздатьЭлемент();
					Организация.Наименование = ЭтотОбъект.НазваниеОрганизации;
					Организация.Записать();
					ТекущийОбъект.Организация = Организация.Ссылка;
					Элементы.Организация.Видимость = Истина;
					Элементы.НазваниеОрганизации.Видимость = Ложь;
				КонецЕсли;
			
			Иначе
				Отказ = Истина;
				Сообщить("Укажите организацию!");
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли Объект.ТипАккаунта <> Перечисления.ТипыАккаунтов.Участник Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Отказ = Истина;
			Сообщить("Укажите организацию!");
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Логин КАК Логин
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Логин = &Логин
		|	И Пользователи.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Логин", Объект.Логин);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Отказ = Истина;
		Сообщить("Логин занят!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТипАккаунтаПриИзмененииНаСервере()
	Если Объект.ТипАккаунта = Перечисления.ТипыАккаунтов.Участник Тогда
		Элементы.Организация.Видимость = Ложь;
		Элементы.НазваниеОрганизации.Видимость = Ложь;
		Объект.Организация = Справочники.Организации.ПустаяСсылка();		
	ИначеЕсли Объект.ТипАккаунта = Перечисления.ТипыАккаунтов.Администратор Тогда
		Элементы.Организация.Видимость = Ложь;
		Элементы.НазваниеОрганизации.Видимость = Истина;
	Иначе
		Элементы.Организация.Видимость = Истина;
		Элементы.НазваниеОрганизации.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипАккаунтаПриИзменении(Элемент)
	ТипАккаунтаПриИзмененииНаСервере();
КонецПроцедуры
