
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.ТипАккаунта = Перечисления.ТипыАккаунтов.Организатор Тогда
		
		// Проверка на новую запись
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда	
			Если ЗначениеЗаполнено(ЭтотОбъект.НазваниеОрганизации) Тогда
				
				// Проверка на уникальную организацию
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ
					|	Организации.Наименование КАК Наименование
					|ИЗ
					|	Справочник.Организации КАК Организации
					|ГДЕ
					|	Организации.Наименование = &Наименование";
				
				Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.НазваниеОрганизации);
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда			
					Отказ = Истина;
					Сообщить("Это название уже занято!");
				Иначе
					// Создание новой организации
					Организация = Справочники.Организации.ПустаяСсылка().ПолучитьОбъект();
					Организация.Наименование = ЭтотОбъект.НазваниеОрганизации;
					Организация.Записать();
					Объект.Организация = Организация.Ссылка;
					Элементы.Организация.Видимость = Истина;
					Элементы.НазваниеОрганизации.Видимость = Ложь;
				КонецЕсли;
			
			Иначе
				Отказ = Истина;
				Сообщить("Укажите организацию!");
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли Объект.ТипАккаунта <> Перечисления.ТипыАккаунтов.Участник Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Отказ = Истина;
			Сообщить("Укажите организацию!");
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ТипАккаунтаПриИзмененииНаСервере()
	Если Объект.ТипАккаунта = Перечисления.ТипыАккаунтов.Участник Тогда
		Элементы.Организация.Видимость = Ложь;
		Элементы.НазваниеОрганизации.Видимость = Ложь;
		Объект.Организация = Справочники.Организации.ПустаяСсылка();		
	ИначеЕсли Объект.ТипАккаунта = Перечисления.ТипыАккаунтов.Организатор Тогда
		Элементы.Организация.Видимость = Ложь;
		Элементы.НазваниеОрганизации.Видимость = Истина;
	Иначе
		Элементы.Организация.Видимость = Истина;
		Элементы.НазваниеОрганизации.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипАккаунтаПриИзменении(Элемент)
	ТипАккаунтаПриИзмененииНаСервере();
КонецПроцедуры
