
Функция ПользовательНайден(СтрокаJSON)Экспорт
	
	 ЧтениеJSON = Новый ЧтениеJSON();
	 ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	 
	 НоменклатураМассив = ПрочитатьJSON(ЧтениеJSON);
	 Для Каждого СтрокаМассива Из НоменклатураМассив Цикл
	 	Логин = Справочники.Пользователи.НайтиПоРеквизиту("Логин", СтрокаМассива.Логин); 
	 	Если Логин.Пустая() Тогда
			СоздатьНоменклатуру(СтрокаМассива);
			Возврат Ложь;
	 	Иначе
	 		Возврат Истина;
	 	КонецЕсли
	 КонецЦикла;

 КонецФункции
 
 Процедура СоздатьНоменклатуру(СтруктураСДанными)
	 
	НоменклатураОбъект = Справочники.Пользователи.СоздатьЭлемент();
	НоменклатураОбъект.Наименование = СтруктураСДанными.Наименование;
	НоменклатураОбъект.Логин = СтруктураСДанными.Логин;
	НоменклатураОбъект.НомерТелефона = СтруктураСДанными.НомерТелефона;
	НоменклатураОбъект.Пароль = СтруктураСДанными.Пароль;
	НоменклатураОбъект.ТипАккаунта = Перечисления.ТипыАккаунтов.Участник;
	
	НоменклатураОбъект.Записать();
	 
 КонецПроцедуры

Функция РегистрацияPOST(Запрос)
	
	СтрокаНоменклатураJSON = Запрос.ПолучитьТелоКакСтроку();
	ПользовательНайден = ПользовательНайден(СтрокаНоменклатураJSON);
	Если ПользовательНайден Тогда
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Пользоваттель существует");
	Иначе
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки("Пользоваттель успешно зарегистрирован");
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

