
Процедура ЗагрузитьНоменклатуруJSON(СтрокаJSON)Экспорт
	
	 ЧтениеJSON = Новый ЧтениеJSON();
	 ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	 
	 НоменклатураМассив = ПрочитатьJSON(ЧтениеJSON);
	 Для Каждого СтрокаМассива Из НоменклатураМассив Цикл
		 СоздатьНоменклатуру(СтрокаМассива);
	 КонецЦикла;

 КонецПроцедуры
 
 Процедура СоздатьНоменклатуру(СтруктураСДанными)
	 
	НоменклатураОбъект = Справочники.Пользователи.СоздатьЭлемент();
	НоменклатураОбъект.Код = СтруктураСДанными.Код;
	НоменклатураОбъект.Наименование = СтруктураСДанными.Наименование;
	НоменклатураОбъект.Логин = СтруктураСДанными.Логин;
	НоменклатураОбъект.НомерТелефона = СтруктураСДанными.НомерТелефона;
	НоменклатураОбъект.Пароль = СтруктураСДанными.Пароль;
	НоменклатураОбъект.ТипАккаунта = Перечисления.ТипыАккаунтов.Участник;
	
	НоменклатураОбъект.Записать();
	 
 КонецПроцедуры

Функция РегистрацияPOST(Запрос)
	
	СтрокаНоменклатураJSON = Запрос.ПолучитьТелоКакСтроку();
	ЗагрузитьНоменклатуруJSON(СтрокаНоменклатураJSON);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Логин КАК Логин
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Логин = &Логин";
	
	
	Запрос.УстановитьПараметр("Логин", );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	Ответ = Новый HTTPСервисОтвет(200);
	
	
	Возврат Ответ;
КонецФункции

