
Функция ОтправкаПубличныхGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Мероприятия.Код КАК Код,
		|	Мероприятия.Наименование КАК Наименование,
		|	Мероприятия.ЧислоУчастников КАК ЧислоУчастников,
		|	Мероприятия.ОбщедоступнаяРегистрация КАК ОбщедоступнаяРегистрация,
		|	Мероприятия.ГлавныйОрганизатор.Наименование КАК ГлавныйОрганизаторНаименование,
		|	Мероприятия.Организация.Наименование КАК ОрганизацияНаименование
		|ИЗ
		|	Справочник.Мероприятия КАК Мероприятия
		|ГДЕ
		|	Мероприятия.ОбщедоступнаяРегистрация = ИСТИНА
		|	И Мероприятия.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыМероприятий.Опубликованное);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МероприятияПуб = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОписаниеМероприятий = Новый Структура;
		ОписаниеМероприятий.Вставить("Код", РезультатЗапроса.Код);
		ОписаниеМероприятий.Вставить("Наименование", РезультатЗапроса.Наименование);
		ОписаниеМероприятий.Вставить("ЧислоУчастников", РезультатЗапроса.ЧислоУчастников);
		ОписаниеМероприятий.Вставить("ОбщедоступнаяРегистрация", РезультатЗапроса.ОбщедоступнаяРегистрация);
		ОписаниеМероприятий.Вставить("ГлавныйОрганизаторНаименование", РезультатЗапроса.ГлавныйОрганизаторНаименование);
		ОписаниеМероприятий.Вставить("ОрганизацияНаименование", РезультатЗапроса.ОрганизацияНаименование);
		
		МероприятияПуб.Добавить(ОписаниеМероприятий);
		
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МероприятияПуб);
	СтрокаТелаЗапроса = ЗаписьJSON.Закрыть(); 
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	Ответ.УстановитьТелоИзСтроки(СтрокаТелаЗапроса);
	
	Возврат Ответ;
КонецФункции

