
Функция ОтправкаПубличныхGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Логин = "";
    Попытка
        Логин = Запрос.ПараметрыЗапроса.Получить("login");
    Исключение
        // Если параметр не передан или произошла ошибка
        Логин = "";
    КонецПопытки;

    // 2. Проверяем, что логин передан
    Если ПустаяСтрока(Логин) Тогда
        Ответ = Новый HTTPСервисОтвет(400);
        Ответ.УстановитьТелоИзСтроки("Не передан параметр login");
        Возврат Ответ;
    КонецЕсли;

    // 3. Проверяем, существует ли пользователь с таким логином
    Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("Логин", Логин);
    Если Пользователь.Пустая() Тогда
        Ответ = Новый HTTPСервисОтвет(404);
        Ответ.УстановитьТелоИзСтроки("Пользователь не найден");
        Возврат Ответ;
    КонецЕсли;
    
	// Изменили имя переменной, чтобы не перетирать входящий параметр Запрос
	ЛокальныйЗапрос = Новый Запрос;
	ЛокальныйЗапрос.Текст =
		"ВЫБРАТЬ
		|	Мероприятия.Код КАК Код,
		|	Мероприятия.Наименование КАК Наименование,
		|	Мероприятия.ЧислоУчастников КАК ЧислоУчастников,
		|	Мероприятия.ОбщедоступнаяРегистрация КАК ОбщедоступнаяРегистрация,
		|	Мероприятия.ГлавныйОрганизатор.Наименование КАК ГлавныйОрганизаторНаименование,
		|	Мероприятия.Организация.Наименование КАК ОрганизацияНаименование,
		|	Мероприятия.ХранилищеКартинки КАК Картинка,
		|	Мероприятия.Статус КАК Статус
		|ИЗ
		|	Справочник.Мероприятия КАК Мероприятия
		|ГДЕ
		|	Мероприятия.ОбщедоступнаяРегистрация
		|	И Мероприятия.Статус = &Статус
		|	И &Логин НЕ В (Мероприятия.СписокУчастников.Участник.Логин)";
		
		
	ЛокальныйЗапрос.УстановитьПараметр("Статус", Перечисления.СтатусыМероприятий.Опубликованное);
	ЛокальныйЗапрос.УстановитьПараметр("Логин", Логин);
	

	РезультатЗапроса = ЛокальныйЗапрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МероприятияПуб = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОписаниеМероприятий = Новый Структура;
		ОписаниеМероприятий.Вставить("Код", ВыборкаДетальныеЗаписи.Код);
		ОписаниеМероприятий.Вставить("Наименование", ВыборкаДетальныеЗаписи.Наименование);
		ОписаниеМероприятий.Вставить("ЧислоУчастников", ВыборкаДетальныеЗаписи.ЧислоУчастников);
		ОписаниеМероприятий.Вставить("ОбщедоступнаяРегистрация", ВыборкаДетальныеЗаписи.ОбщедоступнаяРегистрация);
		ОписаниеМероприятий.Вставить("ГлавныйОрганизаторНаименование", ВыборкаДетальныеЗаписи.ГлавныйОрганизаторНаименование);
		ОписаниеМероприятий.Вставить("ОрганизацияНаименование", ВыборкаДетальныеЗаписи.ОрганизацияНаименование);
		
		// --- БЛОК ОБРАБОТКИ КАРТИНКИ ---
		СтрокаBase64 = Строка(ТипЗнч(ВыборкаДетальныеЗаписи.Картинка)); 
		СтрокаBase64 = "12";
		ХранилищеКартинки = ВыборкаДетальныеЗаписи.Картинка; // Хранилище значения
		
		Если ЗначениеЗаполнено(ХранилищеКартинки) Тогда
			СодержимоеХранилища = ХранилищеКартинки.Получить(); // Двоичные данные
			СтрокаBase64 = "1232";
			СтрокаBase64 = Base64Строка(СодержимоеХранилища);
			СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ПС, "");
			СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ВК, "");
		КонецЕсли;
		
		ОписаниеМероприятий.Вставить("КартинкаBase64", СтрокаBase64);
		// --------------------------------
		
		МероприятияПуб.Добавить(ОписаниеМероприятий);
		
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МероприятияПуб);
	СтрокаТелаЗапроса = ЗаписьJSON.Закрыть(); 
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	Ответ.УстановитьТелоИзСтроки(СтрокаТелаЗапроса);
	
	Возврат Ответ;
КонецФункции

