
Процедура ПриНачалеРаботыСистемы()
	Если СлужбаПользователяСервер.ПроверкаНаНовогоПользователя() Тогда
		Парам = Новый Структура("Ключ", СлужбаПользователяСервер.ВернутьТекПользователя());
		ОткрытьФорму("Справочник.Пользователи.Форма.ФормаЭлемента", Парам)
	Иначе
		Если СлужбаПользователяСервер.ПроверкаНаАдминистратора() Тогда
			ОткрытьФорму("ОбщаяФорма.ЕдинаяСистемаАдминистратора");
		ИначеЕсли СлужбаПользователяСервер.ПроверкаНаОрганизатора() Тогда
			ОткрытьФорму("ОбщаяФорма.РабочийСтолОрганизатора");
		ИначеЕсли СлужбаПользователяСервер.ПроверкаНаУчастника() Тогда 
			ОткрытьФорму("ОбщаяФорма.РабочийСтолУчастника");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
