
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ТекПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Логин = ТекПользователь.Имя;
	ПараметрыСеанса.Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("Логин", Логин);
	
	Если ПараметрыСеанса.Пользователь.Пустая() Тогда
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Логин = Логин;
		НовыйПользователь.Пароль = ТекПользователь.СохраняемоеЗначениеПароля;
		
		Если ТекПользователь.Роли.Содержит(Метаданные.Роли.Администратор) Тогда
			НовыйПользователь.ТипАккаунта = Перечисления.ТипыАккаунтов.Администратор;
		ИначеЕсли ТекПользователь.Роли.Содержит(Метаданные.Роли.Организатор) Тогда
			НовыйПользователь.ТипАккаунта = Перечисления.ТипыАккаунтов.Организатор;
		Иначе
			НовыйПользователь.ТипАккаунта = Перечисления.ТипыАккаунтов.Участник;
		КонецЕсли;
		
		НовыйПользователь.Записать();
		ПараметрыСеанса.Пользователь = НовыйПользователь.Ссылка;
	КонецЕсли;
КонецПроцедуры
