
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыСеанса.Пользователь.ТипАккаунта = Перечисления.ТипыАккаунтов.Организатор Тогда
		Если Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Согласовано Или Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Отклонено Тогда
			Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Черновик;
		КонецЕсли;
	Иначе
		Если Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Согласовано Тогда
			Мероприятие = Справочники.Мероприятия.ПустаяСсылка().ПолучитьОбъект();
			Мероприятие.Наименование = Объект.НазваниеМероприятия;
			Мероприятие.ГлавныйОрганизатор = Объект.ГлавныйОрганизатор;
			Мероприятие.Организация = Объект.Организация;
			Мероприятие.Статус = Перечисления.СтатусыМероприятий.Черновик;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ГлавныйОрганизатор = ПараметрыСеанса.Пользователь.Ссылка;
	Объект.Организация = ПараметрыСеанса.Пользователь.Организация;
	Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Черновик;
КонецПроцедуры
