
&НаСервере
Процедура ГрафикРаботыВыходнойПриИзмененииНаСервере()
	Инд = Элементы.ГрафикРаботы.ТекущаяСтрока;
	Если Объект.ГрафикРаботы[Инд].Выходной Тогда
		Объект.ГрафикРаботы[Инд].ВремяОткрытия = '00010101 12:00:00';
		Объект.ГрафикРаботы[Инд].ВремяЗакрытия = '00010101 12:00:00';
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикРаботыВыходнойПриИзменении(Элемент)
	ГрафикРаботыВыходнойПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗданиеПриИзмененииНаСервере()
	Объект.ГрафикРаботы.Очистить();
	Объект.ГрафикРаботы.Загрузить(Объект.Здание.ВремяРаботыПоУмолчанию.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	ЗданиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = ПараметрыСеанса.Пользователь.Организация;
КонецПроцедуры
