
&НаСервере
Процедура ГрафикРаботыВыходнойПриИзмененииНаСервере()
	Инд = Элементы.ГрафикРаботы.ТекущаяСтрока;
	Если Объект.ГрафикРаботы[Инд].Выходной Тогда
		Объект.ГрафикРаботы[Инд].ВремяОткрытия = '00010101 12:00:00';
		Объект.ГрафикРаботы[Инд].ВремяЗакрытия = '00010101 12:00:00';
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикРаботыВыходнойПриИзменении(Элемент)
	ГрафикРаботыВыходнойПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗданиеПриИзмененииНаСервере()
	Объект.ГрафикРаботы.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗданияОрганизацииВремяРаботыПоУмолчанию.ДеньНедели КАК ДеньНедели,
		|	ЗданияОрганизацииВремяРаботыПоУмолчанию.ВремяОткрытияПоУмолчанию КАК ВремяОткрытия,
		|	ЗданияОрганизацииВремяРаботыПоУмолчанию.ВремяЗакрытияПоУмолчанию КАК ВремяЗакрытия
		|ИЗ
		|	Справочник.ЗданияОрганизации.ВремяРаботыПоУмолчанию КАК ЗданияОрганизацииВремяРаботыПоУмолчанию
		|ГДЕ
		|	ЗданияОрганизацииВремяРаботыПоУмолчанию.Ссылка = &Здание";
	
	Запрос.УстановитьПараметр("Здание", Объект.Здание);
	
	РезультатЗапроса = Запрос.Выполнить();
	Объект.ГрафикРаботы.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	ЗданиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ПараметрыСеанса.Пользователь.Организация;
	КонецЕсли;
КонецПроцедуры
