
&НаСервере
Процедура ВремяРаботыПоУмолчаниюВыходнойПриИзмененииНаСервере()
	Инд = Элементы.ГрафикРаботы.ТекущаяСтрока;
	Если Объект.ГрафикРаботы[Инд].Выходной Тогда
		Объект.ГрафикРаботы[Инд].ВремяОткрытия = '00010101 12:00:00';
		Объект.ГрафикРаботы[Инд].ВремяЗакрытия = '00010101 12:00:00';
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяРаботыПоУмолчаниюВыходнойПриИзменении(Элемент)
	ВремяРаботыПоУмолчаниюВыходнойПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = ПараметрыСеанса.Пользователь.Организация;
	Если НЕ Объект.ВремяРаботыПоУмолчанию.Количество() Тогда
		Для Каждого ДН ИЗ Перечисления.ДниНедели Цикл
			НовСтр = Объект.ВремяРаботыПоУмолчанию.Добавить();
			НовСтр.ДеньНедели = ДН;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
