
&НаКлиенте
Процедура Команда1(Команда)
	ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура ВременноеЗакрытиеАудитории(Команда)
	ОткрытьФорму("Документ.ЗакрытиеАудитории.Форма.ФормаДокумента");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеМероприятиями(Команда)
	ОткрытьФорму("ОбщаяФорма.УправлениеМероприятиями");
КонецПроцедуры

&НаКлиенте
Процедура УправлениеОрганизацией(Команда)
	ОткрытьФорму("ОбщаяФорма.УправлениеОрганизацией");
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаМероприятия(Команда)
	ОткрытьФорму("Документ.ЗаявкаНаМероприятие.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура МероприятияОрганизации(Команда)
	ОткрытьФорму("Справочник.Мероприятия.Форма.ФормаСпискаАдминИОрг");
КонецПроцедуры

&НаКлиенте
Процедура Здания(Команда)
	ОткрытьФорму("Справочник.ЗданияОрганизации.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Аудитории(Команда)
	ОткрытьФорму("Справочник.Аудитории.Форма.ФормаСписка");
КонецПроцедуры
